#Easy
# Задание_1
x = 'Masha'
y = 'Sasha'
z = 'Pasha'
name = input('Введите ваше имя ')
print('привет', name)

#Задание_2
number = input('Введите число ')
print(int(number) + 2)

#Задание_3
mark = 18
age = int(input('Введите Ваш возраст '))

if age >= mark:
    print('Доступ разрешен')
else:
    print('Извините, пользование данным ресурсом только с 18 лет')